1c-desktop-src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c-desktop-src/InformationRegisters/ЦеныНоменклатуры/Forms/ФормаЗагрузки/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьПрайсЛист(Команда)
	СкопироватьФайлНаСервер("ПостроительЗапроса");
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайлНаСервер(СпособЗагрузки)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СкопироватьФайлНаСерверЗавершение", ЭтотОбъект, СпособЗагрузки);
	НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении,,,,,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайлНаСерверЗавершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла <> Неопределено Тогда

	    АдресФайлаВХранилище = ОписаниеПомещенногоФайла.Адрес; //1

	    ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайлаВХранилище, ДатаПрайсЛиста, ВидЦеныПродажи, ДополнительныеПараметры); //2

	КонецЕсли;

КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайлаВХранилище, ДатаПрайсЛиста, ВидЦеныПродажи, ДополнительныеПараметры)
    
    ТабДок = ПрочитатьФайл(АдресФайлаВХранилище); //3
    Если ДополнительныеПараметры = "ТабличныйДокумент" Тогда
        ТаблицаПрайсЛиста = ЗаполнитьТаблицуЗначенийИзТабличногоДокумента(ТабДок); //8
	ИначеЕсли ДополнительныеПараметры = "ПостроительЗапроса" Тогда
		ТаблицаПрайсЛиста = ЗаполнитьТаблицуЗначенийЧерезПостроительЗапроса(ТабДок);
    КонецЕсли;    
    
    Если ТаблицаПрайсЛиста.Количество() Тогда    
        ЗагрузитьПрайсЛистПоставщика(ТаблицаПрайсЛиста, ДатаПрайсЛиста, ВидЦеныПродажи);    //9
    Иначе
        СообщениеПользователю = Новый СообщениеПользователю();
        СообщениеПользователю.Текст = "Выбранный файл не содержит строк с ценами!";
        СообщениеПользователю.Сообщить();            
    КонецЕсли;    
    
КонецПроцедуры


&НаСервереБезКонтекста                            
Функция ПрочитатьФайл(АдресФайлаВХранилище)
    
    ТабДок = Новый ТабличныйДокумент;
    
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xlsx"); //4
    
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище); //5
    ДвоичныеДанные.Записать(ИмяВременногоФайла); //6
    
    Попытка
        ТабДок.Прочитать(ИмяВременногоФайла); //7
    Исключение  
        вызватьИсключение "Не удалось прочитать файл EXCEL в табличный документ!";
    КонецПопытки; 
    
    возврат ТабДок;
            
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьТаблицуЗначенийИзТабличногоДокумента(ТабДок)

	ТаблицаПрайсЛиста = Новый ТаблицаЗначений; //1

	ТаблицаПрайсЛиста.Колонки.Добавить("Код",    Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(13)));
	ТаблицаПрайсЛиста.Колонки.Добавить("Цена",    Новый ОписаниеТипов("Число"));;

	КоличествоСтрок = табДок.ВысотаТаблицы; //2

	Для сч = 1 По КоличествоСтрок Цикл //3

	    СтрокаПрайса = ТаблицаПрайсЛиста.Добавить();

	    Попытка
	        СтрокаПрайса.Код    = Строка(ТабДок.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C1").ТекущаяОбласть.Текст); //4
	        СтрокаПрайса.Цена    = Число(ТабДок.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C2").ТекущаяОбласть.Текст);
	    Исключение
	        вызватьИсключение "Не удалось прочитать файл EXCEL в табличный документ!";
	    КонецПопытки;

	КонецЦикла;

	возврат ТаблицаПрайсЛиста;

КонецФункции 

&НаСервереБезКонтекста
Процедура ЗагрузитьПрайсЛистПоставщика(ТаблицаПрайсЛиста, ДатаПрайсЛиста, ВидЦены)

	Запрос = Новый Запрос; //1
	Запрос.УстановитьПараметр("ТаблицаПрайсЛиста", ТаблицаПрайсЛиста);

	Запрос.Текст=
	"ВЫБРАТЬ
	|    ТаблицаПрайсЛиста.Код КАК Код,
	|    ТаблицаПрайсЛиста.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаПрайсЛиста
	|ИЗ
	|    &ТаблицаПрайсЛиста КАК ТаблицаПрайсЛиста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    Ном.Ссылка КАК Номенклатура,
	|    ВТ_ТаблицаПрайсЛиста.Цена КАК Цена
	|ИЗ
	|    ВТ_ТаблицаПрайсЛиста КАК ВТ_ТаблицаПрайсЛиста
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|        ПО ВТ_ТаблицаПрайсЛиста.Код = Ном.Код";

	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Сообщить("В загруженном файле нет заполненных строк с ценами");
	    возврат;
	КонецЕсли;

	Выборка = Рез.Выбрать();
	
	НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	
	 
	Пока Выборка.Следующий() Цикл
	    НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ДатаПрайсЛиста;
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.ВидЦены = ВидЦены;
		НоваяЗапись.Цена = Выборка.Цена;
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
	
	ТекстСообщения = СтрШаблон("Цены для %1 позиций успешно загружены", НаборЗаписей.Количество());
	Сообщить(ТекстСообщения);
	
Конецпроцедуры 

&НаСервереБезКонтекста
Функция ЗаполнитьТаблицуЗначенийЧерезПостроительЗапроса(ТабДок)

	ОбластиТабличногоДокумента = ТабДок.Область(1, 1, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы); //1

	Построитель = Новый ПостроительЗапроса; //2
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластиТабличногоДокумента); //3
	Построитель.Выполнить();

	ТаблицаПрайсЛиста = Построитель.Результат.Выгрузить(); //4

	возврат ТаблицаПрайсЛиста;

КонецФункции
